Центр_управления_производительностью_демо/src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <predefined>
    <items>
      <name>Наполнитель</name>
      <description>Наполнитель</description>
    </items>
  </predefined>
  <attributes>
    <name>COMКоннекторЗарегистрирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдминистраторКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяБД</name>
    <comment>Имя базы данных на сервере СУБД</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИБ</name>
    <comment>Имя информационной базы в кластере</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБ</name>
    <comment>Основной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПП1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализВзаимоблокировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализГранулярностиБлокировок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализЗапросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализОжиданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППАнализСерверныхВызовов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППОСВзаимоблокировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьППОСТаймауты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПППроизвольныеСчетчикиОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогТрассировкиЛокальный</name>
    <comment>Локальный для сервера СУБД каталог трассировки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаталогТрассировкиСетевой</name>
    <comment>Сетевой каталог трассировки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВерсииСУБД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначенаРольProcessAdmin</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Настроено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольАдминистратораКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБ</name>
    <comment>Основной</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОтладочныеСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортЦентральногоСервера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимУправленияБлокировкойДанных</name>
    <type>
      <types>EnumRef.РежимыУправленияБлокировкойДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверИБ</name>
    <comment>Кластер серверов 1С:Предприятия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверСУБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособАутентификации</name>
    <type>
      <types>EnumRef.СпособыАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОССервераСУБД</name>
    <type>
      <types>EnumRef.ТипыОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСУБД</name>
    <type>
      <types>EnumRef.ТипыСУБД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьТрассировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИменаКаталоговТЖ</name>
    <attributes>
      <name>СерверКластера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Конфигурация</name>
      <comment>Полный путь файла logcfg.xml</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Локальный</name>
      <comment>Локальный для сервера 1С:Предприятия каталог технологического журнала</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сетевой</name>
      <comment>Сетевой каталог технологического журнала</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серверы</name>
    <attributes>
      <name>АгентЦКК</name>
      <type>
        <types>CatalogRef.АгентыЦКК</types>
      </type>
    </attributes>
    <attributes>
      <name>Сервер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособСбораСчетчиков</name>
      <type>
        <types>EnumRef.СпособыСбораСчетчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯзыкОС</name>
      <type>
        <types>CatalogRef.ЯзыкиОС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтатусыШагов</name>
    <attributes>
      <name>ИмяШага</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыШаговМастераНастройки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетчикиОС</name>
    <attributes>
      <name>НомерСтрокиСервера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Счетчик</name>
      <type>
        <types>CatalogRef.СчетчикиПроизводительности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/Catalogs/Сценарии/Сценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сценарии</name>
  <predefined>
    <items>
      <name>Базовый</name>
      <description>Базовый</description>
    </items>
    <items>
      <name>Мониторинг</name>
      <description>Мониторинг</description>
    </items>
    <items>
      <name>Просмотр</name>
      <description>Просмотр</description>
    </items>
  </predefined>
  <attributes>
    <name>Интерактивный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальноеСостояние</name>
    <comment>Начальное состояние</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Структура</name>
    <attributes>
      <name>ТекущееСостояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СледующееСостояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>CatalogRef.События</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыСобытия</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.Команды</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыКоманды</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Центр_управления_производительностью_демо/src/CommonForms/ВыборИБ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьСписокИнформационныхБаз();
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ВЫБОРА ИНФОРМАЦИОННОЙ БАЗЫ

&НаСервере
// Процедура обновляет список информационных баз перечитывая его из базы
//
Процедура ОбновитьСписокИнформационныхБаз()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наполнитель", Справочники.ИнформационныеБазы.Наполнитель);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационнаяБаза.Наименование КАК Наименование,
	               |	ИнформационнаяБаза.Ссылка КАК Ссылка,
	               |	ИнформационнаяБаза.СерверИБ + ""\"" + ИнформационнаяБаза.ИмяИБ КАК Описание
	               |ИЗ
	               |	Справочник.ИнформационныеБазы КАК ИнформационнаяБаза
	               |ГДЕ
	               |	ИнформационнаяБаза.Ссылка <> &Наполнитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Наименование";
	
	ИнформационныеБазы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	Если ТекущаяИБ <> Неопределено Тогда
		Отбор = Новый Структура("Ссылка", ТекущаяИБ);
		СтрокиТЧ = ИнформационныеБазы.НайтиСтроки(Отбор);
		Если СтрокиТЧ.Количество() > 0 Тогда
			ВыбраннаяСтрока = СтрокиТЧ[0];
			Элементы.ИнформационныеБазы.ТекущаяСтрока = ВыбраннаяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступностьЭлементовУправленияИБ();
	
КонецПроцедуры // ОбновитьСписокИнформационныхБаз()

&НаКлиенте
// Процедура обрабатывает выбор (двойной щелчок) информационной базы
//
Процедура ВыбратьИБ(Команда)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры // ВыбратьИБ()

&НаКлиенте
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ВыбратьИЗакрыть()
	
	СтандартнаяОбработка = Ложь;
	ИБ = Элементы.ИнформационныеБазы.ТекущиеДанные.Ссылка;
	
	Если Контекст.Сценарий() = ПредопределенноеЗначение("Справочник.Сценарии.Мониторинг") Тогда
		НастройкиАктуальны = ПроверитьНастройкиИБНаСервере(ИБ);
		Если Не НастройкиАктуальны Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьИЗакрытьЗавершение", ЭтотОбъект, ИБ);
			ТекстПредупреждения = 
				"Необходимо обновить настройки подключения с помощью мастера настроек.
				|Для этого откройте мастер настройки и нажмите кнопку ""Проверить все"".
				|
				|Запустить мастер настройки сейчас?";
			ПоказатьВопрос(ОписаниеОповещения, ТекстПредупреждения, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
		КонецЕсли;
	Иначе
		НастройкиАктуальны = Истина;
	КонецЕсли;
	
	Если НастройкиАктуальны Тогда
		Закрыть(ИБ);
	КонецЕсли;
	
КонецПроцедуры // ОбработатьВыбор()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ВыбратьИЗакрытьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", ДополнительныеПараметры);
	ОткрытьФорму("Справочник.ИнформационныеБазы.Форма.ФормаНастройки", ПараметрыФормы,
		,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры // ВыбратьИЗакрытьЗавершение()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервереБезКонтекста
Функция ПроверитьНастройкиИБНаСервере(ИБ)
	
	Если Не ЗначениеЗаполнено(ИБ.ВерсияНастроек) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // ПроверитьНастройкиИБНаСервере()

&НаКлиенте
// Процедура создает описание подключения к новой информационной базе
//
Процедура ДобавитьИБ(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИБЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.ИнформационныеБазы.ФормаОбъекта",, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиенте
Процедура ДобавитьИБЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТекущаяИБ = Результат;
	КонецЕсли;
	
	ОбновитьСписокИнформационныхБаз();
	
КонецПроцедуры // ДобавитьИБЗавершение()

&НаКлиенте
// Процедура изменяет параметры выбранного подключения к информационной
// базе
Процедура ИзменитьИБ(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьИБЗавершение", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("Ключ", Элементы.ИнформационныеБазы.ТекущиеДанные.Ссылка);
	ОткрытьФорму("Справочник.ИнформационныеБазы.ФормаОбъекта", ПараметрыФормы, 
		ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьИБЗавершение(Параметры, ДополнительныеПараметры) Экспорт
	
	ОбновитьСписокИнформационныхБаз();
	
КонецПроцедуры

&НаКлиенте
// Процедура удаляет выбранное описание подключения к информационной базе
//
Процедура УдалитьИнформационнуюБазу(Элемент)
	
	Перем НачалоИнтервала;
	Перем КонецИнтервала;
	
	Если Элементы.ИнформационныеБазы.ТекущиеДанные <> Неопределено Тогда
		ПараметрыОповещения = 
			Новый Структура("КонецИнтервала, НачалоИнтервала", КонецИнтервала, НачалоИнтервала);
			
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"УдалитьИнформационнуюБазуПродолжение",
			ЭтотОбъект,
			ПараметрыОповещения);
			
		ПоказатьВопрос(ОписаниеОповещения,
		            "Удалить информационную базу """
		                + Элементы.ИнформационныеБазы.ТекущиеДанные.Наименование 
		                + """ из списка и все связанные с ней данные анализа?",
		            РежимДиалогаВопрос.ДаНет,,
		            КодВозвратаДиалога.Нет,
		            "Монитор производительности");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИнформационнуюБазуПродолжение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	КонецИнтервала = ДополнительныеПараметры.КонецИнтервала;
	НачалоИнтервала = ДополнительныеПараметры.НачалоИнтервала;
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ИБ = Элементы.ИнформационныеБазы.ТекущиеДанные.Ссылка;
		ИнформационнаяБаза.ОпределитьИнтервал(ИБ, НачалоИнтервала, КонецИнтервала);
		
		Если НачалоИнтервала <> Неопределено И КонецИнтервала <> Неопределено Тогда
			
			ПараметрыФормы = Новый Структура();
			ПараметрыФормы.Вставить("ИнформационнаяБаза", ИБ);
			ПараметрыФормы.Вставить("НачалоИнтервала", НачалоИнтервала);
			ПараметрыФормы.Вставить("КонецИнтервала", КонецИнтервала);
			ПараметрыФормы.Вставить("Автоматически", Истина);
			ПараметрыФормы.Вставить("УдалятьИБ", Истина);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьИнформационнуюБазуЗавершение", ЭтотОбъект);
			ОткрытьФорму("ОбщаяФорма.Удаление", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // УдалитьИнформационнуюБазу()

&НаКлиенте
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура УдалитьИнформационнуюБазуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьСписокИнформационныхБаз();
	
КонецПроцедуры // УдалитьИнформационнуюБазуЗавершение()

&НаКлиенте
// Процедура отображает описание информационной базы при ее выборе
//
Процедура ИнформационныеБазыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ИнформационныеБазы.ТекущиеДанные <> Неопределено Тогда
		ОписаниеИБ = Элементы.ИнформационныеБазы.ТекущиеДанные.Описание;
		ТекущаяИБ = Элементы.ИнформационныеБазы.ТекущиеДанные.Ссылка;
	КонецЕсли;
	
КонецПроцедуры // ИнформационныеБазыПриАктивизацииСтроки()

&НаСервере
// Процедура устанавливает доступность элементов управления на странице "ВыборИБ"
//
Процедура УстановитьДоступностьЭлементовУправленияИБ()
	
	ИБВыбрана = ИнформационныеБазы.Количество() > 0;
	
	Элементы.ВыбратьИБ.Доступность = ИБВыбрана;
	Элементы.ИзменитьИБ.Доступность = ИБВыбрана;
	Элементы.УдалитьИБ.Доступность = ИБВыбрана;
	
КонецПроцедуры // УстановитьДоступностьЭлементовУправленияИБ()

&НаКлиенте
Процедура ИнформационныеБазыНаименованиеПриИзменении(Элемент)
	
	ИБСсылка = Элементы.ИнформационныеБазы.ТекущиеДанные.Ссылка;
	НовоеНаименование = Элементы.ИнформационныеБазы.ТекущиеДанные.Наименование;
	ИнформационныеБазыНаименованиеПриИзмененииНаСервере(ИБСсылка, НовоеНаименование);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИнформационныеБазыНаименованиеПриИзмененииНаСервере(ИБ, НовоеНаименование)
	
	Справочники.ИнформационныеБазы.ПереименоватьИБ(ИБ, НовоеНаименование);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ОбновитьСписокИнформационныхБаз();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеБазыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбратьИЗакрыть();
	
КонецПроцедуры
